%% 2.4 (c) Karatis Dimitrios 10775

clear;
function f_result = calculate_f(f)    
    % Δεδομένα
    fr = 2.5e9; % Συχνότητα συντονισμού όταν είναι σε σύζευξη σε Hz
    c0 = 3e8; % Ταχύτητα φωτός σε in m/s
    d = 1.6e-3; % Πάχος υποστρώματος FR4
    epsilon_r = 4.4; % Σχετική διηλεκτρική σταθερά FR4
    epsilon_r_eff = 3.33; % Τιμή ενεργούς διηλεκτρικής σταθεράς όπως προέκυψε από το diataxeis2_4a
    W = 0.0031; % Τιμή πλάτους όπως προέκυψε από το diataxeis2_4a
    sigma = 4.5066e6; % Τιμή ηλεκτρικής αγωγιμότητας σ όπως προέκυψε από το diataxeis2_4a
    Z0 = 50; % Χαρακτηριστική αντίσταση γραμμής μικροταινίας

    tand = 0.0371; % Εφαπτομένη απωλειών σύμφωνα με το δίκτυο στη συχνότητα 2.5 GHz
    m0 = 12.57e-7; % Μαγνητική διαπερατότητα κενού


    l = c0/(2*f*sqrt(epsilon_r_eff));

    alpha = sqrt((pi*f*m0)/sigma) / (Z0*W) + ((2*pi*f/c0)*epsilon_r*(epsilon_r_eff-1)*tand)/(2*(epsilon_r-1)*sqrt(epsilon_r_eff));
    
    % Υπολογισμός f
    f_result = tan((2*pi*fr*l)/(c0/sqrt(epsilon_r_eff))) + sqrt((alpha*c0)/(2*fr*sqrt(epsilon_r_eff)));
end

% Δεδομένα
fr = 2.5e9; % Συχνότητα συντονισμού όταν είναι σε σύζευξη σε Hz
c0 = 3e8; % Ταχύτητα φωτός σε in m/s
d = 1.6e-3; % Πάχος υποστρώματος FR4
epsilon_r = 4.4; % Σχετική διηλεκτρική σταθερά FR4
epsilon_r_eff = 3.33; % Τιμή ενεργούς διηλεκτρικής σταθεράς όπως προέκυψε από το diataxeis2_4a
W = 0.0031; % Τιμή πλάτους όπως προέκυψε από το diataxeis2_4a
sigma = 4.5066e6; % Τιμή ηλεκτρικής αγωγιμότητας σ όπως προέκυψε από το diataxeis2_4a
Z0 = 50; % Χαρακτηριστική αντίσταση γραμμής μικροταινίας

tand = 0.0371; % Εφαπτομένη απωλειών σύμφωνα με το δίκτυο στη συχνότητα 2.5 GHz
m0 = 12.57e-7; % Μαγνητική διαπερατότητα κενού

% Αρχική εκτίμηση για το fr
initial_guess = 2.4e9; 

% Λύση με χρήση της fzero
f_result = fzero(@calculate_f, initial_guess);

% Υπολογισμός νέου μήκους συντονιστή
l = c0/(2*f_result*sqrt(epsilon_r_eff));
% Υπολογισμός νέας χωρητικότητας δικένου
C = -1 * tan((2*pi*fr*l)/(c0/sqrt(epsilon_r_eff))) / (Z0 * 2*pi*fr);

disp(['l = ', num2str(l)]);
disp(['C = ', num2str(C)]);

