%% 1.2 (b) Karatis Dimitrios 10775

% Δεδομένα
f0 = 1e9; % Κεντρική συχνότητα σε Hz
c = 3e8; % Ταχύτητα φωτός σε m/s
lambda0 = c / f0; % Μήκος κύματος στη συχνότητα f0
N = 201; % Αριθμός τιμών συχνότητας
ZL = 50; % Τιμή φορτίου σε Ω
l = lambda0 / 8; % Μήκος γραμμών μεταφοράς

% Χαρακτηριστικές αντιστάσεις γραμμών σε Ω
Z01 = 98.45;
Z02 = 101.6;
Z03 = 43.6;
Z04 = 101.6;
Z05 = 98.45;
Z00 = 50;

% Συχνότητες
f = 0:(3*f0/N):(3*f0); % Διάνυσμα συχνοτήτων

% Σταθερά διάδοσης β
beta = (2*pi*f/f0) / lambda0;

Z1 = (-1)*1i*Z01*cot(beta*l); % Αντίσταση εισόδου ανοιχτοκυκλωμένης γραμμής (γραμμή 1)
Z3 = (-1)*1i*Z03*cot(beta*l); % Αντίσταση εισόδου ανοιχτοκυκλωμένης γραμμής (γραμμή 3)
Z5 = (-1)*1i*Z05*cot(beta*l); % Αντίσταση εισόδου ανοιχτοκυκλωμένης γραμμής (γραμμή 5)

Y1 = 1 ./ Z1; % Αγωγιμότητα ανοιχτοκυκλωμένης γραμμής (γραμμή 1)
Y3 = 1 ./ Z3; % Αγωγιμότητα ανοιχτοκυκλωμένης γραμμής (γραμμή 3)
Y5 = 1 ./ Z5; % Αγωγιμότητα ανοιχτοκυκλωμένης γραμμής (γραμμή 5)
YL = 1 / ZL; % Αγωγιμότητα φορτίου

Yin1 = YL + Y1;
Zin1 = 1 ./ Yin1;

Zin2 = Z02 * (Zin1 + 1i*Z02*tan(beta*l)) ./ (Z02 + 1i*Zin1.*tan(beta*l)); % Αντίσταση εισόδου δεξία του κλαδωτή των 43.6 Ω (κλαδωτής 3)
Yin2 = 1 ./ Zin2;

Yin3 = Yin2 + Y3;
Zin3 = 1 ./ Yin3;

Zin4 = Z04 * (Zin3 + 1i*Z04*tan(beta*l)) ./ (Z04 + 1i*Zin3.*tan(beta*l)); % Αντίσταση εισόδου δεξία του κλαδωτή των 98.45 Ω (κλαδωτής 5)
Yin4 = 1 ./ Zin4;

Yin5 = Yin4 + Y5;
Yin = Yin5;
Zin = 1 ./ Yin;

% Υπολογισμός του μέτρου του συντελεστή ανάκλασης Γ στην είσοδο
Gamma = abs((Zin - Z00) ./ (Zin + Z00));
Gamma_dB = 20*log10(Gamma);

% Υπολογισμός του SWR
SWR = (1 + Gamma) ./ (1 - Gamma);
SWR_dB = 20*log10(SWR);

% Εμφάνιση του γραφήματος Gamma σε dB
figure;
plot(f, Gamma_dB);
xlabel('Συχνότητα (Hz)');
ylabel('Μέτρο συντελεστή ανάκλασης (dB)');
title('Μέτρο συντελεστή ανάκλασης (dB) σε συνάρτηση με τη συχνότητα');
grid on;

% Εμφάνισε μέχρι την τιμή max_SWR
max_SWR = 10;

% Φίλτραρε τα δεδομένα
f_filtered = f(SWR <= max_SWR);
SWR_filtered = SWR(SWR <= max_SWR);

% Εμφάνιση του γραφήματος SWR σε dB μέχρι το max_SWR
figure;
plot(f_filtered, SWR_filtered);
xlabel('Συχνότητα (Hz)');
ylabel('SWR');
title('Μέτρο SWR σε συνάρτηση με τη συχνότητα');
grid on;










