%% 1.2 (a) Karatis Dimitrios 10775

% Δεδομένα
f0 = 1e9; % Κεντρική συχνότητα σε Hz
c = 3e8; % Ταχύτητα φωτός σε m/s
lambda0 = c / f0; % Μήκος κύματος στη συχνότητα f0
N = 201; % Αριθμός τιμών συχνότητας
Z0 = 50; % Χαρακτηριστική αντίσταση γραμμών σε Ω
ZL = 100; % Τιμή φορτίου σε Ω
capacitance = 2e-12; % Τιμή πυκνωτή σε F

% Συχνότητες
f = 0:(4*f0/N):(4*f0); % Διάνυσμα συχνοτήτων

% Μήκη γραμμών μεταφοράς
l1 = 0.32 * lambda0; % Μήκος γραμμής στο φορτίο
l2 = 0.24 * lambda0; % Μήκος γραμμής πρίν τον πυκνωτή
lopen = 0.1 * lambda0; % Μήκος ανοιχτοκυκλωμένης γραμμής 

% Σταθερά διάδοσης β
beta = (2*pi*f/f0) / lambda0; 

% Αντιστάσεις εισόδου 
Zin1 = Z0 * (ZL + 1i*Z0*tan(beta*l1)) ./ (Z0 + 1i*ZL*tan(beta*l1)); % Αντίσταση εισόδου δεξία του πυκνωτή
Zinx = Zin1 - 1i./(2*pi*f*capacitance);
Zin2 = Z0 * (Zinx + 1i*Z0*tan(beta*l2)) ./ (Z0 + 1i*Zinx.*tan(beta*l2)); % Αντίσταση εισόδου αριστερά του πυκνωτή
Zin_open = -1*1i*Z0*cot(beta*lopen); % Αντίσταση εισόδου ανοιχτοκυκλωμένης γραμμής

% Μετατροπή σε αγωγιμοτητες 
Yin2 = 1 ./ Zin2; % Αγωγιμότητα εισόδου αριστερά του πυκνωτή
Yin_open = 1 ./ Zin_open; % Αγωγιμότητα εισόδου ανοιχτοκυκλωμένης γραμμής

% Συνολική αγωγιμότητα εισόδου
Yin = Yin_open + Yin2;

% Μετατροπή σε αντίσταση εισόδου
Zin = 1 ./ Yin;

% Υπολογισμός του μέτρου του συντελεστή ανάκλασης Γ στην είσοδο
Gamma = abs((Zin - Z0) ./ (Zin + Z0));
Gamma_dB = 20*log10(Gamma);

% Εμφάνιση του γραφήματος σε καθαρό αριθμό
figure;
plot(f, Gamma);
xlabel('Συχνότητα (Hz)');
ylabel('Μέτρο συντελεστή ανάκλασης');
title('Μέτρο συντελεστή ανάκλασης σε συνάρτηση με τη συχνότητα');
grid on;

% Εμφάνιση του γραφήματος σε dB
figure;
plot(f, Gamma_dB);
xlabel('Συχνότητα (Hz)');
ylabel('Μέτρο συντελεστή ανάκλασης (dB)');
title('Μέτρο συντελεστή ανάκλασης (dB) σε συνάρτηση με τη συχνότητα');
grid on;