%% 1.3 (c) Karatis Dimitrios 10775

% Δεδομένα
f0 = 1e9; % Κεντρική συχνότητα σε Hz
c = 3e8; % Ταχύτητα φωτός σε m/s
lambda0 = c / f0; % Μήκος κύματος στη συχνότητα f0
N = 201; % Αριθμός τιμών συχνότητας
Z0 = 50; % Χαρακτηριστική αντίσταση γραμμών σε Ω
ZL = 10 + 1i*15; % Τιμή φορτίου σε Ω
Zg = 50 - 1i*40; % Αντίσταση γεννήτριας
Vg = 1; % Τάση γεννήτριας σε V rms
c1 = 3.44e-12; % Τιμή πυκνωτή 1ης περίπτωσης(παράλληλα στην είσοδο)
c2 = 5.28e-12; % Τιμή πυκνωτή 2ης περίπτωσης(παράλληλα στην έξοδο)
c3 = 2.45e-12; % Τιμή πυκνωτή 3ης περίπτωσης(σε σειρά στην είσοδο)

% Συχνότητες
f = 0:(2*f0/N):(2*f0); % Διάνυσμα συχνοτήτων

% Μήκη γραμμών μεταφοράς για τις 3 περιπτώσεις
lambda1 = 0.035; % Μήκος γραμμής 1ης περίπτωσης(πυκνωτής παράλληλα στην είσοδο)
lambda2 = 0.100; % Μήκος γραμμής 2ης περίπτωσης(πυκνωτής παράλληλα στην έξοδο)
lambda3 = 0.141; % Μήκος γραμμής 3ης περίπτωσης(πυκνωτής σε σειρά στην είσοδο)

% Αντιστάσεις πυκνωτών για τις 3 περιπτώσεις
Zx1 = -1j * 1 ./ (2 * pi * f * c1); % Αντίσταση πυκνωτή 1ης περίπτωσης(πυκνωτής παράλληλα στην είσοδο)
Zx2 = -1j * 1 ./ (2 * pi * f * c2); % Αντίσταση πυκνωτή 2ης περίπτωσης(πυκνωτής παράλληλα στην έξοδο)
Zx3 = -1j * 1 ./ (2 * pi * f * c3); % Αντίσταση πυκνωτή 3ης περίπτωσης(πυκνωτής σε σειρά στην είσοδο)

% Σταθερές διάδοσης β
beta_l1 = (2*pi*f/f0)*lambda1;
beta_l2 = (2*pi*f/f0)*lambda2;
beta_l3 = (2*pi*f/f0)*lambda3;


%%%%%%%%%%%%%%%%% 1st case %%%%%%%%%%%%%%%%%%%%%%%
% Για 1η περίπτωση(πυκνωτής παράλληλα στην είσοδο)
Zin1 = Z0 * (ZL + 1i*Z0*tan(beta_l1)) ./ (Z0 + 1i*ZL*tan(beta_l1)); % Αντίσταση εισόδου γραμμής 1ης περίπτωσης(πυκνωτής παράλληλα στην είσοδο)

Z1in = (Zin1 .* Zx1) ./ (Zin1 + Zx1);

% Ρεύμα στο Z1in ή αλλιώς συνολικό ρεύμα
I1 = Vg ./ (Zg + Z1in);
I1_norm = abs(I1);

% Ισχύς φορτίου 1ης περίπτωσης(πυκνωτής παράλληλα στην είσοδο)
P1 = real(Z1in) .* I1_norm.^2;

% Συντελεστής ανάκλασης γραμμής στην είσοδο
Gamma1 = (Z1in - Z0) ./ (Z1in + Z0);
Gamma1_norm = abs(Gamma1);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%



%%%%%%%%%%%%%%%%% 2nd case %%%%%%%%%%%%%%%%%%%%%%
% Για 2η περίπτωση(πυκνωτής παράλληλα στην έξοδο)
ZL_C = (ZL .* Zx2)./ (ZL + Zx2);

Z2in = Z0 * (ZL_C + 1i*Z0*tan(beta_l2)) ./ (Z0 + 1i*ZL_C.*tan(beta_l2)); % Αντίσταση εισόδου γραμμής 2ης περίπτωσης(πυκνωτής παράλληλα στην έξοδο)

% Ρεύμα στο Z2in ή αλλιώς συνολικό ρεύμα (θεωρούμε γραμμή χωρίς απώλειες)
I2 = Vg ./ (Zg + Z2in);
I2_norm = abs(I2);

% Ισχύς φορτίου 2ης περίπτωσης(πυκνωτής παράλληλα στην έξοδο)
P2 = real(Z2in) .* I2_norm.^2; % Ισχύς για την περίπτωση 2(πυκνωτής παράλληλα στην έξοδο)

% Συντελεστής ανάκλασης στην είσοδο
Gamma2 = (Z2in - Z0) ./ (Z2in + Z0);
Gamma2_norm = abs(Gamma2);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%




%%%%%%%%%%%%%%%%% 3rd case %%%%%%%%%%%%%%%%%%%%%%
% Για 3η περίπτωση(πυκνωτής σε σειρά στην είσοδο)
Zin3 = Z0 * (ZL + 1i*Z0*tan(beta_l3)) ./ (Z0 + 1i*ZL*tan(beta_l3)); % Αντίσταση εισόδου γραμμής 3ης περίπτωσης(πυκνωτής σε σειρά στην είσοδο)

Z3in = Zin3 + Zx3;

% Ρεύμα στο Z3in ή αλλιώς συνολικό ρεύμα
I3 = Vg ./ (Zg + Z3in);
I3_norm = abs(I3);

% Ισχύς φορτίου 3ης περίπτωσης(πυκνωτής σε σειρά στην είσοδο)
P3 = real(Z3in) .* I3_norm.^2;

% Συντελεστής ανάκλασης στην είσοδο
Gamma3 = (Z3in - Z0) ./ (Z3in + Z0);
Gamma3_norm = abs(Gamma3);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Εμφάνιση του γραφήματος P1-f
figure;
plot(f, P1);
xlabel('Συχνότητα (Hz)');
ylabel('Ισχύς φορτίου');
title('Ισχύς 1ης περίπτωσης(πυκνωτής παράλληλα στην είσοδο)');
grid on;

% Εμφάνιση του γραφήματος |Γin1|-f
figure;
plot(f, Gamma1_norm);
xlabel('Συχνότητα (Hz)');
ylabel('|Γin|');
title('|Γin| 1ης περίπτωσης(πυκνωτής παράλληλα στην είσοδο)');
grid on;

% Εμφάνιση του γραφήματος P2-f
figure;
plot(f, P2);
xlabel('Συχνότητα (Hz)');
ylabel('Ισχύς φορτίου');
title('Ισχύς 2ης περίπτωσης(πυκνωτής παράλληλα στην έξοδο)');
grid on;

% Εμφάνιση του γραφήματος |Γin2|-f
figure;
plot(f, Gamma2_norm);
xlabel('Συχνότητα (Hz)');
ylabel('|Γin|');
title('|Γin| 2ης περίπτωσης(πυκνωτής παράλληλα στην έξοδο)');
grid on;

% Εμφάνιση του γραφήματος P3-f
figure;
plot(f, P3);
xlabel('Συχνότητα (Hz)');
ylabel('Ισχύς φορτίου');
title('Ισχύς 3ης περίπτωσης(πυκνωτής σε σειρά στην είσοδο)');
grid on;

% Εμφάνιση του γραφήματος |Γin3|-f
figure;
plot(f, Gamma3_norm);
xlabel('Συχνότητα (Hz)');
ylabel('|Γin|');
title('|Γin| 3ης περίπτωσης(πυκνωτής σε σειρά στην είσοδο)');
grid on;