%% 2.3 (b) Karatis Dimitrios 10775

clear;
function Gamma = Find_Gamma(l1,l2,f,f0)
    % Δεδομένα
    %f0 = 5e9; % Κεντρική συχνότητα σε Hz
    c0 = 3e8; % Ταχύτητα φωτός σε  in m/s
    lambda0 = c0 / f0; % Μήκος κύματος σε μέτρα
    d = lambda0 / 8; % Απόσταση μεταξύ ανοιχτοκυκλωμένων κλαδωτών
    N = 201; % Αριθμός τιμών συχνότητας
    Z0 = 50; % Χαρακτηριστική αντίσταση γραμμών σε Ω
    ZL = 20 - 1j*30; % Τιμή φορτίου σε Ω

    % Μήκη γραμμών μεταφοράς
    L1 = l1 * lambda0; % Μήκος ανοιχτοκυκλωμένης γραμμής 1
    L2 = l2 * lambda0; % Μήκος ανοιχτοκυκλωμένης γραμμής 2

    % Σταθερά διάδοσης β
    beta = (2*pi*f/f0) / lambda0; 

    YL = 1 ./ ZL;
    Z1in_open = -1*1i*Z0*cot(beta*L1); % Αντίσταση εισόδου ανοιχτοκυκλωμένης γραμμής 1
    Y1in_open = 1 ./ Z1in_open;

    Y1 = YL + Y1in_open;
    Z1 = 1 ./ Y1;

    Z2 = Z0 * (Z1 + 1i*Z0*tan(beta*d)) ./ (Z0 + 1i*Z1.*tan(beta*d));
    Y2 = 1 ./ Z2;

    Z2in_open = -1*1i*Z0*cot(beta*L2); % Αντίσταση εισόδου ανοιχτοκυκλωμένης γραμμής 2
    Y2in_open = 1 ./ Z2in_open;

    Yin = Y2 + Y2in_open;
    Zin = 1 ./ Yin;

    % Υπολογισμός του μέτρου του συντελεστή ανάκλασης Γ στην είσοδο
    Gamma = abs((Zin - Z0) ./ (Zin + Z0));
end

% Συχνότητες
f0 = 5e9;
N=201;
f = 0:(2*f0/N):(2*f0); % Διάνυσμα συχνοτήτων


% Εμφάνιση του γραφήματος σε καθαρό αριθμό
figure;
plot(f / 10^9, Find_Gamma(0.108, 0.179, f, f0), 'r', 'DisplayName', 'Μικρά μήκη');
xlabel('Συχνότητα (GHz)');
ylabel('Μέτρο συντελεστή ανάκλασης');
title({'Μέτρο συντελεστή ανάκλασης συναρτήσει της συχνότητας'});
hold on;
plot(f / 10^9, Find_Gamma(0.365, 0.465, f, f0), 'b', 'DisplayName', 'Μεγάλα μήκη');
xlabel('Συχνότητα (GHz)');
ylabel('Μέτρο συντελεστή ανάκλασης');
title({'Μέτρο συντελεστή ανάκλασης συναρτήσει της συχνότητας'});
yline(0.316, '--k', 'DisplayName', '|Γ| = 0.316');
hold off;
legend()

