%% 1.4 (a) Karatis Dimitrios 10775

function mean_G = mean_Gamma(p)

    % Ορισμός των παραμέτρων
    d1 = p(1);
    d2 = p(2);
    d3 = p(3);
    l1 = p(4);
    l2 = p(5);
    l3 = p(6);

    % Δεδομένα
    f0 = 0.3e9; % Κεντρική συχνότητα σε Hz(Την όρισα εγώ αυθαίρετα ώστε λ = 1, σύμφωνα με την εκφώνηση)
    c = 3e8; % Ταχύτητα φωτός σε m/s
    lambda0 = c / f0; % Μήκος κύματος στη συχνότητα f0
    ZL = 120 + 1i*60; % Τιμή φορτίου σε Ω
    Z0 = 50; % Χαρακτηριστική αντίσταση γραμμών σε Ω

    % Διάνυσμα κανονικοποιημένων συχνοτήτων
    normf = (0.5:0.01:1.5);

    % Σταθερά διάδοσης β
    beta = (2*pi*normf) / lambda0;

    % Αντιστάσεις εισόδου ανοιχτοκυκλωμένων γραμμών
    Zl1 = (-1)*1i*Z0*cot(beta*l1); % Αντίσταση εισόδου ανοιχτοκυκλωμένης γραμμής μήκους l1
    Zl2 = (-1)*1i*Z0*cot(beta*l2); % Αντίσταση εισόδου ανοιχτοκυκλωμένης γραμμής μήκους l2
    Zl3 = (-1)*1i*Z0*cot(beta*l3); % Αντίσταση εισόδου ανοιχτοκυκλωμένης γραμμής μήκους l3


    % Αγωγιμότητες ανοιχτοκυκλωμένων γραμμών
    Yl1 = 1 ./ Zl1; % Αγωγιμότητα ανοιχτοκυκλωμένης γραμμής μήκους l1
    Yl2 = 1 ./ Zl2; % Αγωγιμότητα ανοιχτοκυκλωμένης γραμμής μήκους l2
    Yl3 = 1 ./ Zl3; % Αγωγιμότητα ανοιχτοκυκλωμένης γραμμής μήκους l3

    % Αντιστάσεις εισόδου 
    Zin1 = Z0 * (ZL + 1i*Z0*tan(beta*d1)) ./ (Z0 + 1i*ZL*tan(beta*d1)); % Αντίσταση εισόδου δεξιά της ανοιχτοκυκλωμένης γραμμής μηκους l1
    Yin1 = 1 ./ Zin1;
    
    Yin2 = Yl1 + Yin1;
    Zin2 = 1 ./ Yin2;       

    Zin3 = Z0 * (Zin2 + 1i*Z0*tan(beta*d2)) ./ (Z0 + 1i*Zin2.*tan(beta*d2)); % Αντίσταση εισόδου δεξιά της ανοιχτοκυκλωμένης γραμμής μηκους l2
    Yin3 = 1 ./ Zin3;

    Yin4 = Yl2 + Yin3;
    Zin4 = 1 ./ Yin4;

    Zin5 = Z0 * (Zin4 + 1i*Z0*tan(beta*d3)) ./ (Z0 + 1i*Zin4.*tan(beta*d3)); % Αντίσταση εισόδου δεξιά της ανοιχτοκυκλωμένης γραμμής μηκους l3
    Yin5 = 1 ./ Zin5;

    Yin6 = Yl3 + Yin5;

    Yin = Yin6; % Συνολική αντίσταση εισόδου
    Zin = 1 ./ Yin; % Συνολική αγωγιμότητα εισόδου
    
    % Υπολογισμός του μέτρου του συντελεστή ανάκλασης Γ στην είσοδο
    Gamma = abs((Zin - Z0) ./ (Zin + Z0));
    
    mean_G = mean(Gamma);

end